-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Июн 07 2021 г., 01:50
-- Версия сервера: 10.3.16-MariaDB
-- Версия PHP: 7.3.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `bookstore1`
--

-- --------------------------------------------------------

--
-- Структура таблицы `книги`
--

CREATE TABLE `книги` (
  `книга_id` bigint(20) UNSIGNED NOT NULL,
  `автор` text COLLATE utf8_bin NOT NULL,
  `название` text COLLATE utf8_bin NOT NULL,
  `жанр` text COLLATE utf8_bin NOT NULL,
  `издательство` text COLLATE utf8_bin NOT NULL,
  `город_издания` text COLLATE utf8_bin NOT NULL,
  `год_издания` int(11) NOT NULL,
  `количество` int(11) NOT NULL,
  `стоимость_продажи` float NOT NULL,
  `картинка` char(20) COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- Дамп данных таблицы `книги`
--

INSERT INTO `книги` (`книга_id`, `автор`, `название`, `жанр`, `издательство`, `город_издания`, `год_издания`, `количество`, `стоимость_продажи`, `картинка`) VALUES
(101, 'Пушкин А.С.', 'Борис Годунов', 'поэма', 'Бонни', 'Москва', 2018, 10, 150, 'images/101.jpeg'),
(102, 'Пушкин А.С.', 'Каменный гость', 'трагедия', 'Бонни', 'Москва', 2020, 10, 300, 'images/102.jpeg'),
(103, 'Пушкин А.С.', 'Пир во время чумы', 'трагедия', 'АСТ', 'Москва', 2020, 10, 230, 'images/103.jpeg'),
(104, 'Достоевский Ф.М.', 'Преступление ', 'роман', 'АСТ', 'Санкт-Петербург', 2020, 10, 170, 'images/104.jpeg'),
(105, 'Достоевский Ф.М.', 'Игрок', 'роман', 'АСТ', 'Санкт-Петербург', 2020, 10, 150, 'images/105.jpeg'),
(106, 'Достоевский Ф.М.', 'Бесы', 'роман', 'АСТ', 'Санкт-Петербург', 2019, 10, 320, 'images/106.jpg'),
(107, 'Достоевский Ф.М.', 'Белые ночи', 'роман', 'АСТ', 'Санкт-Петербург', 2021, 10, 180, 'images/107.jpg'),
(108, 'Ахматова А.А.', 'Реквием', 'стихи', 'Бонни', 'Москва', 2021, 10, 120, 'images/108.jpg'),
(109, 'Ахматова А.А.', 'Стихотворения', 'стихи', 'Бонни', 'Москва', 2020, 10, 120, 'images/109.jpg'),
(110, 'Толстой Л.Н.', 'Война и мир', 'роман', 'АСТ', 'Москва', 2019, 10, 240, 'images/110.jpg'),
(111, 'Толстой Л.Н.', 'Хаджи Мурат', 'роман', 'АСТ', 'Санкт-Петербург', 2021, 10, 210, 'images/111.jpg'),
(112, 'Толстой Л.Н.', 'Анна Каренина', 'роман', 'Бонни', 'Москва', 2018, 10, 250, 'images/112.jpg'),
(113, 'Булгаков М.А.', 'Мастер и Маргарита', 'роман', 'АСТ', 'Москва', 2021, 10, 240, 'images/113.jpeg'),
(114, 'Булгаков М.А.', 'Иван Васильевич', 'роман', 'АСТ', 'Санкт-Петербург', 2020, 10, 320, 'images/114.jpg'),
(115, 'Булгаков М.А.', 'Белая гвардия', 'роман', 'Бонни', 'Москва', 2020, 10, 260, 'images/115.jpg'),
(116, 'Гоголь Н.В.', 'Шинель', 'повесть', 'Бонни', 'Москва', 2019, 10, 230, 'images/116.jpg'),
(117, 'Гоголь Н.В.', 'Вий', 'повесть', 'АСТ', 'Москва', 2020, 10, 130, 'images/117.jpg'),
(118, 'Гоголь Н.В.', 'Нос', 'повесть', 'Бонни', 'Москва', 2020, 10, 180, 'images/118.jpg'),
(119, 'Гоголь Н.В.', 'Ревизор', 'комедия', 'АСТ', 'Санкт-Петербург', 2021, 10, 200, 'images/119.jpg'),
(120, 'Пушкин А.С.', 'Скупой рыцарь', 'трагедия', 'АСТ', 'Санкт-Петербург', 2021, 10, 260, 'images/200.jpg'),
(121, 'Пушкин А.С.', 'Капитанская дочка', 'роман', 'АСТ', 'Москва', 2019, 10, 170, 'images/201.jpg'),
(122, 'Пушкин А.С.', 'Сборник стихотворений', 'стихи', 'АСТ', 'Москва', 2020, 10, 150, 'images/202.jpg'),
(123, 'Булгаков М.А.', 'Собачье сердце', 'повесть', 'Бонни', 'Москва', 2020, 10, 190, 'images/203.jpg');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `книги`
--
ALTER TABLE `книги`
  ADD PRIMARY KEY (`книга_id`),
  ADD UNIQUE KEY `книга_id` (`книга_id`);
ALTER TABLE `книги` ADD FULLTEXT KEY `автор` (`автор`);
ALTER TABLE `книги` ADD FULLTEXT KEY `название` (`название`);
ALTER TABLE `книги` ADD FULLTEXT KEY `жанр` (`жанр`);
ALTER TABLE `книги` ADD FULLTEXT KEY `издательство` (`издательство`);
ALTER TABLE `книги` ADD FULLTEXT KEY `город_издания` (`город_издания`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `книги`
--
ALTER TABLE `книги`
  MODIFY `книга_id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=126;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `книги`
--
ALTER TABLE `книги`
  ADD CONSTRAINT `книги_ibfk_1` FOREIGN KEY (`книга_id`) REFERENCES `книги` (`книга_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
